src/cf/Catalogs/CRM_РядыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_РядыСобытий</Name>
			<Comment>Ряды событий</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдПовтСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьГрафикРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_РядыСобытий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Возвращает расписание по ссылке на элемент справочника.
//
Функция ПолучитьРасписание(Ссылка) Экспорт
	Расписание = Ссылка.Расписание.Получить();
	Если ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		Возврат Расписание;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Возвращает представление расписания.
//
Функция ПолучитьПредставлениеРасписания(Знач Расписание = Неопределено, Ссылка = Неопределено, ОграничитьДлиной = Неопределено) Экспорт
	Если Ссылка = Неопределено И Расписание = Неопределено Тогда Возврат ""; КонецЕсли;
	
	Если Расписание = Неопределено Тогда
		Расписание = ПолучитьРасписание(Ссылка);
		Если Расписание = Неопределено Тогда Возврат ""; КонецЕсли;
	ИначеЕсли ТипЗнч(Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		Возврат "";
	КонецЕсли;
	
	ПредставлениеРасписания = Строка(Расписание);
	
	ПозицияТочкаСЗапятой = Найти(ПредставлениеРасписания, ";");
	Если ПозицияТочкаСЗапятой > 0 Тогда
		ПредставлениеРасписания = Лев(ПредставлениеРасписания, ПозицияТочкаСЗапятой - 1);
	КонецЕсли;
	
	Если ТипЗнч(ОграничитьДлиной) = Тип("Число") Тогда
		Если СтрДлина(ПредставлениеРасписания) > ОграничитьДлиной Тогда
			ПредставлениеРасписания = Лев(ПредставлениеРасписания, ОграничитьДлиной - 3) + "...";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Строка(ПредставлениеРасписания);
КонецФункции

// Возвращает массив дат входящих в указанный период по расписанию.
//
Функция ПолучитьМассивДатРасписания(Знач ДатаНачало, Знач ДатаОкончания, Ссылка = Неопределено, Знач Расписание = Неопределено) Экспорт
	МассивДат = Новый Массив();
	
	Если Ссылка = Неопределено И Расписание = Неопределено Тогда Возврат МассивДат; КонецЕсли;
	
	Если Расписание = Неопределено Тогда
		Расписание = ПолучитьРасписание(Ссылка);
		Если Расписание = Неопределено Тогда Возврат МассивДат; КонецЕсли;
	КонецЕсли;
	
	Если ДатаНачало > ДатаОкончания Тогда Возврат МассивДат; КонецЕсли;
	
	ПустаяДата = Дата("00010101");
	ПроверяемоеВремя = Дата("00010101000001");
	
	Расписание.ВремяНачала = ПроверяемоеВремя;
	Расписание.ВремяКонца = ПустаяДата;
	
	// Формирование массива дат
	ШагДатыВСекундах = 24 * 60 * 60; // событие выполняется не чаще раза в день
	ДатаОкончанияКонецДня = КонецДня(ДатаОкончания);
	ТекДата = КонецДня(ДатаНачало);
	
	ПредыдущаяДата = Неопределено;
	Пока ТекДата <= ДатаОкончанияКонецДня Цикл
		Если ПредыдущаяДата = Неопределено Тогда
			бТребуетсяВыполнение = Расписание.ТребуетсяВыполнение(ТекДата);
		Иначе
			бТребуетсяВыполнение = Расписание.ТребуетсяВыполнение(ТекДата, ПредыдущаяДата);
		КонецЕсли;
		Если бТребуетсяВыполнение Тогда
			ДатаПоРасписанию = НачалоДня(ТекДата);
			МассивДат.Добавить(ДатаПоРасписанию);
			ПредыдущаяДата = ДатаПоРасписанию + (ПроверяемоеВремя - ПустаяДата);
		КонецЕсли;
		
		ТекДата = ТекДата + ШагДатыВСекундах;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.УчитыватьГрафикРаботы Тогда
		
		СоответствиеДат = CRM_КалендарныеГрафики.ПолучитьСоответствиеДатРабочихДней(МассивДат);
		
		НовыйМассивДат = Новый Массив;
		
		Для каждого ЭлементМассива Из МассивДат Цикл
			
			ДатаСоответствия = СоответствиеДат.Получить(ЭлементМассива); 
			
			Если ДатаСоответствия = Неопределено Тогда
				
				НовыйМассивДат.Добавить(ЭлементМассива);
				
			ИначеЕсли НовыйМассивДат.Найти(ДатаСоответствия) = Неопределено Тогда	
			
				НовыйМассивДат.Добавить(ДатаСоответствия);

			КонецЕсли;			
			
		КонецЦикла;
		
		МассивДат = НовыйМассивДат;
	
	КонецЕсли; 
	
	Возврат МассивДат;
КонецФункции



#КонецЕсли
